RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_pwc.c
/**
 *******************************************************************************
 * @file  hc32_ll_pwc.c
 * @brief This file provides firmware functions to manage the Power Control(PWC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_pwc.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_PWC PWC
 * @brief Power Control Driver Library
 * @{
 */

#if (LL_PWC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup PWC_Local_Macros PWC Local Macros
 * @{
 */

/* Get the backup register address of PWC */

#define PWC_SYSCLK_SRC_HRC          (0U)
#define PWC_SYSCLK_SRC_PLL          (5U)

#define PWC_MD_SWITCH_TIMEOUT       (30UL)
#define PWC_MD_SWITCH_TIMEOUT2      (0x1000UL)
#define PWC_MD_SWITCH_CMD           (0x10U)

#define PWC_LVD_EN_REG              (CM_PWC->PVDCR0)
#define PWC_LVD_EN_BIT              (PWC_PVDCR0_PVD1EN)
#define PWC_LVD_EXT_INPUT_EN_REG    (CM_PWC->PVDCR0)
#define PWC_LVD_EXT_INPUT_EN_BIT    (PWC_PVDCR0_EXVCCINEN)
#define PWC_LVD_CMP_OUTPUT_EN_REG   (CM_PWC->PVDCR1)
#define PWC_LVD_CMP_OUTPUT_EN_BIT   (PWC_PVDCR1_PVD1CMPOE)
#define PWC_LVD_FILTER_EN_REG       (CM_PWC->PVDFCR)
#define PWC_LVD_FILTER_EN_BIT       (PWC_PVDFCR_PVD1NFDIS)
#define PWC_LVD_STATUS_REG          (CM_PWC->PVDDSR)

#define PWC_LVD2_POS                (4U)
#define PWC_LVD_BIT_OFFSET(x)       ((uint8_t)((x) * PWC_LVD2_POS))
#define PWC_LVD_EN_BIT_OFFSET(x)    (x)

#define PWC_PRAM_MASK               (PWC_RAM_PD_SRAM1   | PWC_RAM_PD_SDIO0 |    \
                                     PWC_RAM_PD_SRAM2   | PWC_RAM_PD_SDIO1 |    \
                                     PWC_RAM_PD_SRAM3   | PWC_RAM_PD_CAN   |    \
                                     PWC_RAM_PD_SRAMH   | PWC_RAM_PD_CACHE |    \
                                     PWC_RAM_PD_USBFS)

#define PWC_LVD_FLAG_MASK           (PWC_LVD1_FLAG_MON | PWC_LVD1_FLAG_DETECT | \
                                     PWC_LVD2_FLAG_MON | PWC_LVD2_FLAG_DETECT)

#define PWC_LVD_EXP_NMI_POS         (8U)

/**
 * @defgroup PWC_Check_Parameters_Validity PWC Check Parameters Validity
 * @{
 */
/* Check CLK register lock status. */
#define IS_PWC_CLK_UNLOCKED()       ((CM_PWC->FPRC & PWC_FPRC_FPRCB0) == PWC_FPRC_FPRCB0)

/* Check PWC register lock status. */
#define IS_PWC_UNLOCKED()           ((CM_PWC->FPRC & PWC_FPRC_FPRCB1) == PWC_FPRC_FPRCB1)
/* Check PWC LVD register lock status. */
#define IS_PWC_LVD_UNLOCKED()       ((CM_PWC->FPRC & PWC_FPRC_FPRCB3) == PWC_FPRC_FPRCB3)
/* Parameter validity check for EFM lock status. */
#define IS_PWC_EFM_UNLOCKED()       (CM_EFM->FAPRT == 0x00000001UL)

#define IS_PWC_STOP_WKUP_SRC(x)                                                 \
(   ((x) == INT_SRC_USART1_WUPI)                    ||                          \
    ((x) == INT_SRC_TMR0_1_CMP_A)                   ||                          \
    ((x) == INT_SRC_RTC_ALM)                        ||                          \
    ((x) == INT_SRC_RTC_PRD)                        ||                          \
    ((x) == INT_SRC_WKTM_PRD)                       ||                          \
    ((x) == INT_SRC_CMP1)                           ||                          \
    ((x) == INT_SRC_LVD1)                           ||                          \
    ((x) == INT_SRC_LVD2)                           ||                          \
    ((x) == INT_SRC_SWDT_REFUDF)                    ||                          \
    ((x) == INT_SRC_PORT_EIRQ0)                     ||                          \
    ((x) == INT_SRC_PORT_EIRQ1)                     ||                          \
    ((x) == INT_SRC_PORT_EIRQ2)                     ||                          \
    ((x) == INT_SRC_PORT_EIRQ3)                     ||                          \
    ((x) == INT_SRC_PORT_EIRQ4)                     ||                          \
    ((x) == INT_SRC_PORT_EIRQ5)                     ||                          \
    ((x) == INT_SRC_PORT_EIRQ6)                     ||                          \
    ((x) == INT_SRC_PORT_EIRQ7)                     ||                          \
    ((x) == INT_SRC_PORT_EIRQ8)                     ||                          \
    ((x) == INT_SRC_PORT_EIRQ9)                     ||                          \
    ((x) == INT_SRC_PORT_EIRQ10)                    ||                          \
    ((x) == INT_SRC_PORT_EIRQ11)                    ||                          \
    ((x) == INT_SRC_PORT_EIRQ12)                    ||                          \
    ((x) == INT_SRC_PORT_EIRQ13)                    ||                          \
    ((x) == INT_SRC_PORT_EIRQ14)                    ||                          \
    ((x) == INT_SRC_PORT_EIRQ15))

/* Parameter validity check for peripheral RAM setting of power mode control */
#define IS_PWC_PRAM_CONTROL(x)                                                  \
(   ((x) != 0x00UL)                           &&                                \
    (((x) | PWC_PRAM_MASK) == PWC_PRAM_MASK))

/* Parameter validity check for RAM setting of MCU operating mode */
#define IS_PWC_RAM_MD(x)                                                        \
(   ((x) == PWC_RAM_HIGH_SPEED)               ||                                \
    ((x) == PWC_RAM_ULOW_SPEED))

/* Parameter validity check for LVD channel. */
#define IS_PWC_LVD_CH(x)                                                        \
(   ((x) == PWC_LVD_CH1)                      ||                                \
    ((x) == PWC_LVD_CH2))

