RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_pwc.c
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
/**
 * @defgroup PWC_Local_Variables PWC Local Variables
 * @{
 */
static uint32_t NVIC_ISER_BAK[5];
static uint8_t  m_u8HrcState = 0U;
static uint8_t  m_u8MrcState = 0U;
static uint8_t  m_u8WkupIntCount = 0U;
static uint8_t  m_u8StopFlag = 0U;
static uint8_t  m_u8SysClockSrouce = 1U;
/**
 * @}
 */

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup PWC_Local_Functions PWC Local Functions
 * @{
 */

/**
 * @brief  Select system clock source.
 * @param  u8SysSrc     The system clock source.
 * @retval None
 * @note   Must close all of the fcg register before switch system clock source.
 **        This function only be called in func. PWC_ClockBackup and
 **        PWC_ClockRecover.
 **        If need to switch system clock please call CLK_SetSysClkSource.
 */
static void PWC_SetSysClk(uint8_t u8SysSrc)
{
    __IO uint32_t fcg0 = CM_PWC->FCG0;
    __IO uint32_t fcg1 = CM_PWC->FCG1;
    __IO uint32_t fcg2 = CM_PWC->FCG2;
    __IO uint32_t fcg3 = CM_PWC->FCG3;

    DDL_ASSERT(IS_PWC_CLK_UNLOCKED());

    /* Only current system clock source or target system clock source is MPLL
    need to close fcg0~fcg3 and open fcg0~fcg3 during switch system clock source.
    We need to backup fcg0~fcg3 before close them. */
    if ((PWC_SYSCLK_SRC_PLL == (CM_CMU->CKSWR & CMU_CKSWR_CKSW)) || (PWC_SYSCLK_SRC_PLL == u8SysSrc)) {
        /* Close fcg0~fcg3. */
        CM_PWC->FCG0 = 0xFFFFFAEEUL;
        CM_PWC->FCG1 = 0xFFFFFFFFUL;
        CM_PWC->FCG2 = 0xFFFFFFFFUL;
        CM_PWC->FCG3 = 0xFFFFFFFFUL;

        DDL_DelayUS(1UL);
    }

    WRITE_REG8(CM_CMU->CKSWR, u8SysSrc);

    /* update system clock frequency. */
    SystemCoreClockUpdate();

    DDL_DelayUS(1UL);

    /* Open fcg0~fcg3. */
    CM_PWC->FCG0 = fcg0;
    CM_PWC->FCG1 = fcg1;
    CM_PWC->FCG2 = fcg2;
    CM_PWC->FCG3 = fcg3;

    DDL_DelayUS(1UL);
}

/**
 * @brief  Backup HRC/MRC state and system clock , enable HRC/MRC ,set MRC as
 *         system clock before enter stop mode.
 * @param  None
 * @retval None
 */
static void PWC_ClockBackup(void)
{
    __IO uint32_t timeout = 0UL;
    uint8_t u8State;

    DDL_ASSERT(IS_PWC_CLK_UNLOCKED());

    /* HRC state backup. */
    m_u8HrcState = READ_REG8_BIT(CM_CMU->HRCCR, CMU_HRCCR_HRCSTP);
    /* System clock backup*/
    m_u8SysClockSrouce = CM_CMU->CKSWR & CMU_CKSWR_CKSW;

    /* Enable HRC  before enter stop mode. */
    if (0U != m_u8HrcState) {
        CM_CMU->HRCCR = 0U;
        do {
            u8State = READ_REG8_BIT(CM_CMU->OSCSTBSR, CMU_OSCSTBSR_HRCSTBF);
            timeout++;
        } while ((timeout < 0x1000UL) && (u8State != CMU_OSCSTBSR_HRCSTBF));
    }

    /* When system clock source is HRC or MPLL, set MRC as system clock. . */
    if ((PWC_SYSCLK_SRC_HRC == m_u8SysClockSrouce) || (PWC_SYSCLK_SRC_PLL == m_u8SysClockSrouce)) {
        if (0U == READ_REG8_BIT(CM_PWC->STPMCR, PWC_STPMCR_CKSMRC)) {
            /* MRC state backup. */
            m_u8MrcState = READ_REG8_BIT(CM_CMU->MRCCR, CMU_MRCCR_MRCSTP);
            if (0x80U != m_u8MrcState) {
                CM_CMU->MRCCR = 0x80U;
                __NOP();
                __NOP();
                __NOP();
                __NOP();
                __NOP();
            }
        }
        PWC_SetSysClk(1U);
    }
}

/**
 * @brief  Recover HRC/MRC state and system clock after wakeup stop mode.
 * @param  None
 * @retval None
 */
static void PWC_ClockRecover(void)
{
    DDL_ASSERT(IS_PWC_CLK_UNLOCKED());

    if (0U == READ_REG8_BIT(CM_PWC->STPMCR, PWC_STPMCR_CKSMRC)) {
        if ((PWC_SYSCLK_SRC_HRC == m_u8SysClockSrouce) || (PWC_SYSCLK_SRC_PLL == m_u8SysClockSrouce)) {
            /* Recover MRC state & system clock source. */
            PWC_SetSysClk(m_u8SysClockSrouce);
            MODIFY_REG8(CM_CMU->MRCCR, CMU_MRCCR_MRCSTP, m_u8MrcState);
        }
        /* Recover HRC state after wakeup stop mode. */
        WRITE_REG8(CM_CMU->HRCCR, m_u8HrcState);
    }
    /* Update system clock */
    SystemCoreClockUpdate();
}
/**
 * @}
 */

/**
 * @defgroup PWC_Global_Functions PWC Global Functions
 * @{
 */
/**
 * @brief  Enter power down mode.
 * @param  None
 * @retval None
 */
__RAM_FUNC void PWC_PD_Enter(void)
{
    WRITE_REG16(CM_PWC->FPRC, PWC_UNLOCK_CODE1);

    CLR_REG8_BIT(CM_PWC->PVDCR1, PWC_PVDCR1_PVD1IRS | PWC_PVDCR1_PVD2IRS);
    SET_REG16_BIT(CM_PWC->STPMCR, PWC_STPMCR_STOP);

    __disable_irq();
    SET_REG8_BIT(CM_PWC->PWRC0, PWC_PWRC0_PWDN);
    for (uint8_t i = 0U; i < 10U; i++) {
        __NOP();
    }
    __enable_irq();

    __WFI();
}

/**
 * @brief  NVIC backup and disable before entry from stop mode
 * @param  None
 * @retval None
 */
void PWC_STOP_NvicBackup(void)
{
    uint8_t u8Count;
    __IO uint32_t *INTC_SELx;
    uint32_t u32WakeupSrc;

    /* Backup NVIC set enable register for IRQ0~143*/
    for (u8Count = 0U; u8Count < sizeof(NVIC_ISER_BAK) / sizeof(uint32_t); u8Count++) {
        NVIC_ISER_BAK[u8Count] = NVIC->ISER[u8Count];
    }

    /* Disable share vector */
    for (u8Count = 128U; u8Count < 144U; u8Count++) {
        NVIC_DisableIRQ((IRQn_Type)u8Count);
    }

    for (u8Count = 0U; u8Count < 128U; u8Count++) {
        INTC_SELx = (__IO uint32_t *)((uint32_t)(&CM_INTC->SEL0) + (4UL * u8Count));
        /* Disable NVIC if it is the wakeup-able source from stop mode */
        u32WakeupSrc = (uint32_t)(*INTC_SELx) & INTC_SEL_INTSEL;
        if (IS_PWC_STOP_WKUP_SRC((en_int_src_t)u32WakeupSrc)) {
            switch (u32WakeupSrc) {
                case INT_SRC_USART1_WUPI:
                    if (0UL == bCM_INTC->WUPEN_b.RXWUEN) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_TMR0_1_CMP_A:
                    if (0UL == bCM_INTC->WUPEN_b.TMR0WUEN) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_RTC_ALM:
                    if (0UL == bCM_INTC->WUPEN_b.RTCALMWUEN) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_RTC_PRD:
                    if (0UL == bCM_INTC->WUPEN_b.RTCPRDWUEN) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_WKTM_PRD:
                    if (0UL == bCM_INTC->WUPEN_b.WKTMWUEN) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_CMP1:
                    if (0UL == bCM_INTC->WUPEN_b.CMPI0WUEN) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_LVD1:
                    if (0UL == bCM_INTC->WUPEN_b.PVD1WUEN) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_LVD2:
                    if (0UL == bCM_INTC->WUPEN_b.PVD2WUEN) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_SWDT_REFUDF:
                    if (0UL == bCM_INTC->WUPEN_b.SWDTWUEN) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ0:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN0) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ1:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN1) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ2:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN2) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ3:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN3) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ4:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN4) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ5:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN5) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ6:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN6) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ7:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN7) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ8:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN8) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ9:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN9) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ10:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN10) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ11:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN11) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ12:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN12) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ13:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN13) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ14:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN14) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                case INT_SRC_PORT_EIRQ15:
                    if (0UL == bCM_INTC->WUPEN_b.EIRQWUEN15) {
                        NVIC_DisableIRQ((IRQn_Type)u8Count);
                    }
                    break;
                default:
                    break;
            }
        } else if ((uint32_t)INT_SRC_MAX != u32WakeupSrc) {
            /* Disable NVIC for all none-wakeup source */
            NVIC_DisableIRQ((IRQn_Type)u8Count);
        } else {
            ;
        }
    }
}

/**
 * @brief  NVIC recover after wakeup from stop mode
 * @param  None
 * @retval None
 */
void PWC_STOP_NvicRecover(void)
{
    uint8_t u8Count;

    for (u8Count = 0U; u8Count < sizeof(NVIC_ISER_BAK) / sizeof(uint32_t); u8Count++) {
        NVIC->ISER[u8Count] = NVIC_ISER_BAK[u8Count];
    }
}

/**
 * @brief  Clock backup before enter stop mode and mark it.
 * @param  None
 * @retval None
 */
void PWC_STOP_ClockBackup(void)
{
    /* Disable all interrupt to ensure the following operation continued. */
    __disable_irq();

    /* HRC/MRC backup and switch system clock as MRC before entry from stop mode. */
    PWC_ClockBackup();

    /* Mark the system clock has been switch as MRC, and will enter the stop mode. */
    m_u8StopFlag = 1U;

    /* Enable all interrupt. */
    __enable_irq();
}

/**
 * @brief  Clock recover after wakeup stop mode.
 * @param  None
 * @retval None
 */
void PWC_STOP_ClockRecover(void)
{
    /* Disable all interrupt to ensure the following operation continued. */
    __disable_irq();

